rmick/esp32_IR_Ltto/ESP32_IR_LTTO.cpp

/* Copyright (c) 2018 Richie Mickan. All Rights Reserved.
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, version 3.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>. *
 *
 * Based on the Code from Neil Kolban: https://github.com/nkolban/esp32-snippets/blob/master/hardware/infra_red/receiver/rmt_receiver.c
 * Based on the Code from pcbreflux: https://github.com/pcbreflux/espressif/blob/master/esp32/arduino/sketchbook/ESP32_IR_Remote/ir_demo/ir_demo.ino
 * Based on the Code from Xplorer001: https://github.com/ExploreEmbedded/ESP32_RMT
 * Based on the Code from Darryl Scott: https://github.com/Darryl-Scott/ESP32-RMT-Library-IR-code-RAW
 */

/* This library uses the RMT hardware in the ESP32 to send/receive LTTO infrared data.
 * It uses a single channel of the RMT, therefore up to 8 instances can be used in a single sketch.
 */

#include "Arduino.h"
#ifdef __cplusplus
extern "C" {
#endif

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"
#include "freertos/ringbuf.h"



#ifdef __cplusplus
}
#endif

#include "ESP32_IR_LTTO.h"

////////////////////////////////////
#define         DEBUG       false
////////////////////////////////////

#define PRE_SYNC_MARK        3000
#define PRE_SYNC_SPACE       6000
#define BEACON_HEADER        6000
#define TAG_PACKET_HEADER    3000
#define MARK_SPACE           2000
#define ZERO_BIT             1000
#define ONE_BIT              2000
#define INTERPACKET_DEFAULT 25000
#define INTERPACKET_TAG     56000
#define INTERPACKET_CSUM    80000
#define VARIATION             .20   // 20%

#define BEACON_BIT_COUNT            5
#define LTAR_BEACON_BIT_COUNT       9
#define TAG_BIT_COUNT               7
#define PACKET_BIT_COUNT            9
#define DATA_BIT_COUNT              8
#define CHECKSUM_BIT_COUNT          9
#define CHECKSUM_BIT_SET            256


#define ROUND_TO                1   //50          //rounding value for microseconds timings
#define MARK_EXCESS             0   //100         //tweeked to get the right timing
#define SPACE_EXCESS            0   //50          //tweeked to get the right timing
#define TIMEOUT_US              5   //50          //RMT receiver timeout value(us)
#define MIN_CODE_LENGTH         5                 //Minimum data pulses received for a valid packet

#define PACKET                  'P'
#define DATA                    'D'
#define CHECKSUM                'C'
#define TAG                     'T'
#define BEACON                  'Z'
#define LTAR_BEACON             'E'
#define BCD                     true
#define LTAR                    true


// Clock divisor (base clock is 80MHz)
#define CLK_DIV                 80

// Number of clock ticks that represent 10us.  10 us = 1/100th msec.
#define TICK_10_US              (80000000 / CLK_DIV / 100000) // = 10

static RingbufHandle_t          ringBuf;

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

ESP32_IR::ESP32_IR()
{
    if(DEBUG)   Serial.print("ESP32_IR::Constructing");
}

//////////////////////////////////////////////////////////////////////////////////////////

bool ESP32_IR::ESP32_IRrxPIN(int _rxPin, int _channel)
{
    bool _status = true;
    
    if (_rxPin >= GPIO_NUM_0 && _rxPin < GPIO_NUM_MAX)      gpioNum = _rxPin;
    else                                                    _status = false;
    
    if (_channel >= RMT_CHANNEL_0 && _channel < RMT_CHANNEL_MAX)  rmtPort = _channel;
    else                                                    _status = false;
    
    if(_status == false && DEBUG) Serial.println("ESP32_IR::Rx Pin init failed");
    return _status;
}

//////////////////////////////////////////////////////////////////////////////////////////

bool ESP32_IR::ESP32_IRtxPIN(int _txPin, int _channel)
{
    bool _status = true;
    
    if (_txPin >= GPIO_NUM_0 && _txPin < GPIO_NUM_MAX)      gpioNum = _txPin;
    else                                                    _status = false;
    
    if (_channel >= RMT_CHANNEL_0 && _channel < RMT_CHANNEL_MAX)  rmtPort = _channel;
    else                                                    _status = false;
    
    if(_status == false && DEBUG) Serial.println("ESP32_IR::Tx Pin init failed");
    return _status;
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::initReceive()
{
    rmt_config_t config;
    config.rmt_mode = RMT_MODE_RX;
    config.channel = (rmt_channel_t)rmtPort;
    config.gpio_num = (gpio_num_t)gpioNum;
    gpio_pullup_en((gpio_num_t)gpioNum);
    config.mem_block_num = 1; //how many memory blocks 64 x N (0-7)
    config.rx_config.filter_en = 1;
    config.rx_config.filter_ticks_thresh = 100; // 80000000/100 -> 800000 / 100 = 8000  = 125us
    config.rx_config.idle_threshold = TICK_10_US * 100 * 8;      // 8mS
    config.clk_div = CLK_DIV;
    ESP_ERROR_CHECK(rmt_config(&config));
    ESP_ERROR_CHECK(rmt_driver_install(config.channel, 1000, 0));
    rmt_get_ringbuf_handle(config.channel, &ringBuf);
    rmt_rx_start(config.channel, 1);
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::initTransmit()
{
  rmt_config_t config;
  config.channel = (rmt_channel_t)rmtPort;
  config.gpio_num = (gpio_num_t)gpioNum;
  config.mem_block_num = 1;//how many memory blocks 64 x N (0-7)
  config.clk_div = CLK_DIV;
  config.tx_config.loop_en = false;
  config.tx_config.carrier_duty_percent = 50;
  config.tx_config.carrier_freq_hz = 38000;
  config.tx_config.carrier_level = (rmt_carrier_level_t)1;
  config.tx_config.carrier_en = 1;
  config.tx_config.idle_level = (rmt_idle_level_t)0;
  config.tx_config.idle_output_en = true;
  config.rmt_mode = (rmt_mode_t)0;//RMT_MODE_TX;
  rmt_config(&config);
  rmt_driver_install(config.channel, 0, 0);//19     /*!< RMT interrupt number, select from soc.h */
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::sendIR(rmt_item32_t data[], int IRlength, bool waitTilDone)
{
    if(DEBUG)   Serial.println("ESP32_IR::sendIR()");
    rmt_config_t config;
    config.channel = (rmt_channel_t)rmtPort;
    rmt_write_items(config.channel, data, IRlength, waitTilDone);  //false means non-blocking
    //Wait until sending is done.
    if(waitTilDone)
    {
        rmt_wait_tx_done(config.channel,1);
        //before we free the data, make sure sending is already done.
        //free(data);
    }
}

//////////////////////////////////////////////////////////////////////////////////////////

