rmick/esp32_IR_Ltto/ESP32_IR_LTTO.cpp
void ESP32_IR::sendLttoIR(String _fullDataString)
{
    int _delimiterPosition  = 0;
    
    clearIRdataArray();
    //remove any whitespace (and the \r\n)
    _fullDataString.trim();
    
    while(_fullDataString.length() > 0)
    {
        char _packetType = _fullDataString.charAt(0);
        _fullDataString.remove(0, 1);
        
        _delimiterPosition = _fullDataString.indexOf(":");
        uint16_t _data = _fullDataString.substring(0,_delimiterPosition).toInt();
        _fullDataString.remove(0, _delimiterPosition + 1);
        
        //add data to array
        encodeLTTO(_packetType, _data);
    }
    //send the data
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::sendLttoIR(char _type, int _data)
{
    if(DEBUG)
    {
        Serial.print("\tESP32_IR::sendLTTOtoIR(Type,Data) - ");
        Serial.print(_type);Serial.print("\t");
        Serial.print(_data);
    }
    
    clearIRdataArray();
    encodeLTTO(_type, _data);
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void    ESP32_IR::sendBrxTest()
{
    const uint16_t    BRX_START     = 2000;
    const uint16_t    BRX_SPACE     =  500;
    const uint16_t    BRX_ONE       = 1000;
    const uint16_t    BRX_ZERO      =  500;
    
    clearIRdataArray();
    
    //Create MAB
    irDataArray[0].duration0 = BRX_START;
    irDataArray[0].level0    = 1;
    irDataArray[0].duration1 = BRX_SPACE;
    irDataArray[0].level1    = 0;
    
    for(int index = 1; index < 25; index++)
    {
        static bool oddEven = true;
        if (oddEven) irDataArray[index].duration0 = BRX_ONE;
        else         irDataArray[index].duration0 = BRX_ZERO;
        oddEven = !oddEven ;
        irDataArray[index].duration0 = BRX_ONE;
        irDataArray[index].level0    = 1;
        irDataArray[index].duration1 = BRX_SPACE;
        irDataArray[index].level1    = 0;
    }
    irDataArray[25].duration0 = BRX_ZERO;
    irDataArray[25].level0    = 1;
    irDataArray[25].duration1 = BRX_SPACE;
    irDataArray[25].level1    = 0;
    
    sendIR(irDataArray, sizeof(irDataArray) );
    Serial.println("\n----------\nBrx sent\n----------");
}


//////////////////////////////////////////////////////////////////////////////////////////


void ESP32_IR::clearIRdataArray()
{
    if(DEBUG)   Serial.println("ESP32_IR::clearIRdataArray");
    for(int index = 0; index < ARRAY_SIZE; index++)
    {
        irDataArray[index].duration0 = 0;
        irDataArray[index].level0    = 0;
        irDataArray[index].duration1 = 0;
        irDataArray[index].level1    = 0;
    }
    arrayIndex          = 0;
}

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::encodeLTTO(char _type, uint16_t _data)
{
    int             _syncHeader         = 0;
    int             _bitCount           = 0;
    int             _endOfPacketDelay   = 0;
    bool            _setEndOfPacket     = false;
    static int      _totalMessageTime   = 0;
    
    //calculate the type an set parameters
    switch (_type)
    {
        case TAG:
            _syncHeader         = TAG_PACKET_HEADER;
            _bitCount           = TAG_BIT_COUNT;
            _endOfPacketDelay   = INTERPACKET_TAG;
            _setEndOfPacket     = true;
            break;
        case BEACON:
            _syncHeader         = BEACON_HEADER;
            _bitCount           = BEACON_BIT_COUNT;
            _endOfPacketDelay   = INTERPACKET_DEFAULT;
            _setEndOfPacket     = true;
            break;
        case LTAR_BEACON:
            _syncHeader         = BEACON_HEADER;
            _bitCount           = LTAR_BEACON_BIT_COUNT;
            _endOfPacketDelay   = INTERPACKET_DEFAULT;
            _setEndOfPacket     = true;
            break;
        case PACKET:
            _syncHeader         = TAG_PACKET_HEADER;
            _bitCount           = PACKET_BIT_COUNT;
            _endOfPacketDelay   = INTERPACKET_DEFAULT;
            calculatedCheckSum  = _data;
            _totalMessageTime   = 0;
            break;
        case DATA:
            _syncHeader         = TAG_PACKET_HEADER;
            _bitCount           = DATA_BIT_COUNT;
            _endOfPacketDelay   = INTERPACKET_DEFAULT;
            calculatedCheckSum += _data;
            break;
        case CHECKSUM:
            _syncHeader         = TAG_PACKET_HEADER;
            _bitCount           = CHECKSUM_BIT_COUNT;
            _endOfPacketDelay   = INTERPACKET_CSUM;
            _setEndOfPacket     = true;
            calculatedCheckSum  = calculatedCheckSum % 256;      // CheckSum is the remainder of dividing by 256.
            calculatedCheckSum  = calculatedCheckSum | 256;      // Set the required 9th MSB bit to 1 to indicate it is a checksum
            _data = calculatedCheckSum;
            break;
        default:
            if(DEBUG)   Serial.println("ESP32_IR:: ERROR - No match for TYPE:");
            break;
    }
    
    if(DEBUG)
    {
        Serial.print("\tESP32_IR::encodeLTTO (String) - ");
        Serial.print(_type);Serial.print(" ");
        Serial.println(_data);
    }
    
    //Populate the array
    //PreSync
    irDataArray[arrayIndex].duration0 = PRE_SYNC_MARK;
    irDataArray[arrayIndex].level0    = 1;
    irDataArray[arrayIndex].duration1 = PRE_SYNC_SPACE;
    irDataArray[arrayIndex++].level1  = 0;
    
    _totalMessageTime += (PRE_SYNC_MARK + PRE_SYNC_SPACE);
    
    //Header
    irDataArray[arrayIndex].duration0 = _syncHeader;
    irDataArray[arrayIndex].level0    = 1;
    irDataArray[arrayIndex].duration1 = MARK_SPACE;
    irDataArray[arrayIndex++].level1  = 0;
    
    _totalMessageTime += (_syncHeader + MARK_SPACE);
    
