rmick/esp32_IR_Ltto/ESP32_IR_LTTO.cpp
    //Data
    int _dataPulse = 0;
    _bitCount--;
    
    while (_bitCount >= 0)
    {
        _dataPulse = (bitRead(_data, _bitCount)+1) * 1000;            // the +1 is to convert 0/1 data into 1/2mS pulses.
        
        irDataArray[arrayIndex].duration0 = _dataPulse;
        irDataArray[arrayIndex].level0    = 1;
        irDataArray[arrayIndex].duration1 = MARK_SPACE;
        irDataArray[arrayIndex++].level1  = 0;
        
        _totalMessageTime += (_dataPulse + MARK_SPACE);

        _bitCount--;
    }
    
    //Set the end of data marker
    irDataArray[arrayIndex].duration0 = (_endOfPacketDelay/2);
    irDataArray[arrayIndex].level0    = 0;
    irDataArray[arrayIndex].duration1 = (_endOfPacketDelay/2);
    irDataArray[arrayIndex++].level1  = 0;
    
    _totalMessageTime += _endOfPacketDelay;
    
    if(_setEndOfPacket)
    {
        //Serial.print("\tESP32_IR::encodeLTTO() - Packet Length = ");Serial.print(_totalMessageTime/1000.0);Serial.println("mS");
        irDataArray[arrayIndex].duration0 = 0;
        irDataArray[arrayIndex].level0    = 0;
        irDataArray[arrayIndex].duration1 = 0;
        irDataArray[arrayIndex].level1    = 0;
    }
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::stopIR()
{
    rmt_config_t config;
    config.channel = (rmt_channel_t)rmtPort;
    rmt_rx_stop(config.channel);
    if(DEBUG)   Serial.print("ESP32_IR::Uninstalling..");
    if(DEBUG)   Serial.print("Port : "); Serial.println(config.channel);
    rmt_driver_uninstall(config.channel);
}

//////////////////////////////////////////////////////////////////////////////////////////

bool ESP32_IR::irAvailabl()
{
//    bool returnValue = false;
//
//    RingbufHandle_t rb = NULL;
//    rmt_config_t config;
//    config.channel = (rmt_channel_t)rmtPort;
//    rmt_get_ringbuf_handle(config.channel, &rb);
//
//    while(rb)
//    {
//        size_t itemSize = 0;    //Size of ringBuffer data
//        rmt_item32_t *item = (rmt_item32_t*) xRingbufferReceive(rb, &itemSize, (TickType_t)TIMEOUT_US);
//        int numItems = itemSize / sizeof(rmt_item32_t);
//
//        if( numItems == 0)
//        {
//            returnValue = false;
//        }
//        else
//        {
//            memset(irDataRxArray, 0, sizeof(irDataRxArray));
//            decodeLTTO(item, numItems, irDataRxArray);
//            vRingbufferReturnItem(ringBuf, (void*) item);
//            returnValue = true;
//        }
//
//    }
//    //vTaskDelete(NULL);
//    return returnValue;
}

//////////////////////////////////////////////////////////////////////////////////////////

int ESP32_IR::readIR(unsigned int *irDataRx, int maxBuf)
{
    RingbufHandle_t rb = NULL;
    rmt_config_t config;
    config.channel = (rmt_channel_t)rmtPort;
    rmt_get_ringbuf_handle(config.channel, &rb);
    
    while(rb)
    {
        size_t itemSize = 0;    //Size of ringBuffer data
        rmt_item32_t *item = (rmt_item32_t*) xRingbufferReceive(rb, &itemSize, (TickType_t)TIMEOUT_US);
        int numItems = itemSize / sizeof(rmt_item32_t);
        if( numItems == 0)  return 0;
        //Serial.print("ESP32_IR::readIR() - Found num of Items =");Serial.println(numItems*2-1);
        memset(irDataRx, 0, maxBuf);
        //decodeRAW(item, numItems, irDataRx);
        decodeLTTO(item, numItems, irDataRx);
        vRingbufferReturnItem(ringBuf, (void*) item);
        return (numItems*2-1);
    }
    //TODO : work out why this is here and do we really need it !!!!
    Serial.println("ESP32_IR::readIR() - Do we ever get here?");
    vTaskDelete(NULL);
  return 0;
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::decodeRAW(rmt_item32_t *rawDataIn, int numItems, unsigned int *irDataOut)
{
    if(DEBUG)   Serial.print("ESP32_IR::Raw IR Code :");
    int _bitCount = 0;
    for (int index = 0; index < numItems; index++)
    {
        getDataIR(rawDataIn[index], irDataOut, _bitCount);
        _bitCount = _bitCount + 2;
    }
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::getDataIR(rmt_item32_t item, unsigned int* irDataOut, int index) {
    unsigned int lowValue = (item.duration0) * (10 / TICK_10_US)-SPACE_EXCESS;
    lowValue = ROUND_TO * round((float)lowValue/ROUND_TO);
    //Serial.print(lowValue);Serial.print("L ,");
    irDataOut[index] = lowValue;
    unsigned int highValue = (item.duration1) * (10 / TICK_10_US)+MARK_EXCESS;
    highValue = ROUND_TO * round((float)highValue/ROUND_TO);
    //Serial.print(highValue);Serial.print("H ,");
    irDataOut[index+1] = highValue;
}

//////////////////////////////////////////////////////////////////////////////////////////

bool ESP32_IR::decodeLTTO(rmt_item32_t *rawDataIn, int numItems, unsigned int *irDataOut)
{
    //Serial.println("-----------------------");
    bool _validPreSync      = false;
    bool _validHeader       = false;
    bool _isBeaconData      = false;
    bool _isTagPacketData   = false;
    bool _validDataPacket   = false;
    bool _badMarkSpace      = false;
    bool _badData           = false;
    
    //Clear the message data
    lttoMessage.type = ' ';
    lttoMessage.data = 0;
    
    /*  Pseudo Code
     -Create a structure char+unsigned int
     -Check for the PreSync 3+6
     -Get packet value
     -Set value (unsigned int)
     -Check packet length and value
     -Check for Header 3 or 6 - set type (char)
     return true if good data, or false if bad data
     */
    
    //Check for the Pre Sync pulses.
    if(checkData(rawDataIn, 0, 0, PRE_SYNC_MARK) && checkData(rawDataIn, 0, 1, PRE_SYNC_SPACE) )
        _validPreSync = true;
        //Serial.println("ESP32_IR:: PreSyncOK!");
 
    int _bitCount = numItems-2;
    
    //Calculate the valus of the bits.
    int _totalOfBits = 0;
    bool firstPass = true;
    for (int index = 2; index <= _bitCount+1; index++) //start at 2 to miss PreSync and Header.
    {
        if      (checkData(rawDataIn, index, 0, ONE_BIT))
        {
            //_totalOfBits = (_totalOfBits << 1) | 1;
            _totalOfBits = _totalOfBits << 1;
            _totalOfBits = _totalOfBits +1;
            //Serial.println("ESP32_IR:: Bit = ONE");
        }
        else if (checkData(rawDataIn, index, 0, ZERO_BIT))
        {
            _totalOfBits = _totalOfBits << 1;
            //Serial.println("ESP32_IR:: Bit = ZERO");
        }
        else
        {
            _badData = true;
        }
        //Serial.print("ESP32_IR:: Counting Data = "); Serial.println(_totalOfBits);
        
        if (!checkData(rawDataIn, index, 1, MARK_SPACE))
        {
            _badMarkSpace = true;
        }
    }
    lttoMessage.data = _totalOfBits;
    //Serial.print("ESP32_IR:: Data = "); Serial.println(lttoMessage.data);
    
    
    //Work out the packet type
    if      (checkData(rawDataIn, 1, 0, TAG_PACKET_HEADER))
    {
        _isTagPacketData = true;
        _validHeader     = true;
        //Serial.println("ESP32_IR:: isTagPacketData");
        //Now work out if it is a Tag, Packet, Data or Checksum
        //Serial.print("ESP32_IR:: _bitCount = ");Serial.println(_bitCount);
        switch (_bitCount)
        {
            case TAG_BIT_COUNT:
                lttoMessage.type = TAG;
                break;
            case PACKET_BIT_COUNT: //CHECKSUM_BIT_COUNT
                if      (lttoMessage.data < CHECKSUM_BIT_SET)     lttoMessage.type = PACKET;
                else if (lttoMessage.data >= CHECKSUM_BIT_SET)    lttoMessage.type = CHECKSUM;
                break;
            case DATA_BIT_COUNT:
                lttoMessage.type = DATA;
                break;
            default:
                lttoMessage.type = 'V';  //Void
                break;
        }
        //Serial.print("ESP32_IR:: Type = ");Serial.println(lttoMessage.type);
    }
    else if (checkData(rawDataIn,1,0, BEACON_HEADER))
    {
        _isBeaconData = true;
        _validHeader  = true;
        //Serial.println("ESP32_IR:: isBeaconData");
        int _bitCount = numItems-2;
        //Serial.print("ESP32_IR:: _bitCount = ");Serial.println(_bitCount);
        switch (_bitCount)
        {
            case BEACON_BIT_COUNT:
                lttoMessage.type = BEACON;
                Serial.println("ESP32:: LTTO Beacon");
                break;
            case LTAR_BEACON_BIT_COUNT:
                lttoMessage.type = LTAR_BEACON;
                Serial.println("ESP32:: LTAR Beacon");
                break;
            default:
                lttoMessage.type = 'V';   //Void
                break;
        }
        //Serial.print("ESP32_IR:: Type = ");Serial.println(lttoMessage.type);
    }
    else
    {
        _validHeader = false;
    }
        
    //Check all sections are valid and return result.
        if(_validPreSync && _validHeader && !_badMarkSpace && !_badData) _validDataPacket = true;
        
        return _validDataPacket;
}

//////////////////////////////////////////////////////////////////////////////////////////

bool ESP32_IR::checkData(rmt_item32_t *rawDataIn, int _index, int _itemToCheck, unsigned int _expectedDuration)
{
    bool _result = false;
    
    if(_itemToCheck == 0)
    {
        if(rawDataIn[_index].duration0 >= (_expectedDuration - (_expectedDuration * VARIATION))
           &&
           rawDataIn[_index].duration0 <= (_expectedDuration + (_expectedDuration * VARIATION)) )
           {
               _result = true;
           }
    }
    else if(_itemToCheck == 1)
    {
        if(rawDataIn[_index].duration1 >= (_expectedDuration - (_expectedDuration * VARIATION))
           &&
           rawDataIn[_index].duration1 <= (_expectedDuration + (_expectedDuration * VARIATION)) )
           {
               _result = true;
           }
    }
    else _result = false;
           
