rmick/esp32_IR_Ltto/ESP32_IR_LTTO.cpp
    return _result;
}

//////////////////////////////////////////////////////////////////////////////////////////

char    ESP32_IR::readMessageType()
{
    return lttoMessage.type;
}

uint16_t ESP32_IR::readRawDataPacket()
{
    return lttoMessage.data;
}

////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////

//Calculating BCD and the CheckSum.
//This is here because it always does my head in !!!!!
//Certain Data is BCD Hex                               It means it is 2 x 4bit numbers in a single Byte
//                                                      Therefore 10 is actually 0001 0000 (which is 0x16)
//                                                      and       42 is actually 0100 0010 (which is 0x64)
//                                                      and       79 is actually 0111 1001 (which is 0x121)
//                                                      and      100 becomes     1111 1111 (which is 0xFF)
//This means that '10' is actually 0x16.
//However other data (taggerID, GameID, Flags, etc) are just plain Hex/Dec all the time.
//****** Now comes the nasty part!!!!! ******
//The LazerSwarm then needs all data sent as actual Hex, whereas the LTTO library expects it as Dec '10'.
//The CheckSum is the Sum of the final Hex values or Decimal values AFTER conversion (where applicable) to BCD.

//////////////////////////////////////////////////////////////////////////////////////////

int ESP32_IR::hostPlayerToGame(uint8_t _teamNumber, uint8_t _playerNumber,  uint8_t _gameType,
                               uint8_t _gameID,     uint8_t _gameLength,    uint8_t _health,
                               uint8_t _reloads,    uint8_t _shields,       uint8_t _megaTags,
                               uint8_t _flags1,     uint8_t _flags2,        int8_t _flags3)
{
    uint16_t        _taggerID               = -1;    // -1 means failed !
    uint8_t         _codeLength             = 0;
    bool            _isLtar                 = true;
    
    if(_flags3 == -1)   _isLtar = false;
    
    //callBack();

    if(DEBUG)   Serial.println("ESP32_IR - announcing game : ");

    //convert specific data packets to BCD
    if(_isLtar == false)
    {
        _gameLength = convertDecToBCD(_gameLength);
        _health     = convertDecToBCD(_health);
        _reloads    = convertDecToBCD(_reloads);
        _shields    = convertDecToBCD(_shields);
        _megaTags   = convertDecToBCD(_megaTags);
    }

    clearIRdataArray();

    encodeLTTO(PACKET,  _gameType);
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _gameLength);
    encodeLTTO(DATA,    _health);
    encodeLTTO(DATA,    _reloads);
    encodeLTTO(DATA,    _shields);
    encodeLTTO(DATA,    _megaTags);
    encodeLTTO(DATA,    _flags1);
    encodeLTTO(DATA,    _flags2);
    if(_isLtar) encodeLTTO(DATA, _flags3);
    encodeLTTO(CHECKSUM);

    sendIR(irDataArray, sizeof(irDataArray) );
        
    //pseudo code
    //  if(cancelHosting) interval = infinite
    //  if(interval > millis() ) sendHostGame
    //  if(irReply.startsWith "P16" respond
    //    else if(irReply.startsWith "P17" respond

    return _taggerID;
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::assignPlayer(uint8_t _gameID, uint8_t _taggerID, uint8_t _teamNumber, uint8_t _playerNumber, bool _isLtar)
{
    if(DEBUG)
    {
        Serial.print("ESP32_IR::assignPlayer() - Team = ");
        Serial.print(_teamNumber);
        Serial.print(", Player = ");
        Serial.println(_playerNumber);
    }
    
    uint8_t _teamAndPlayer = encodeTeamAndPlayer(_teamNumber, _playerNumber);
    
    clearIRdataArray();
    
    if(_isLtar) encodeLTTO(PACKET,  131);
    else        encodeLTTO(PACKET,    1);
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _taggerID);
    encodeLTTO(DATA,    _teamAndPlayer);
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
    
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::assignPlayerFailed(uint8_t _gameID, uint8_t _taggerID, bool _isLtar)
{
    if(DEBUG)   Serial.print("ESP32_IR::assignPlayerFailed() - TaggerID: ");
    if(DEBUG)   Serial.println(_taggerID);
    
    clearIRdataArray();
    
    if(_isLtar) encodeLTTO(PACKET,  143);
    else        encodeLTTO(PACKET,   15);
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _taggerID);
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::ltarAssignPlayerSuccess(uint8_t _gameID, uint8_t _teamNumber, uint8_t _playerNumber)
{
    if(DEBUG)   Serial.println("ESP32_IR::ltarAssignPlayerSuccess()");

    uint8_t _teamAndPlayer = encodeTeamAndPlayer(_teamNumber, _playerNumber);
    
    clearIRdataArray();
    
    encodeLTTO(PACKET,  135);
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _teamAndPlayer);
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::requestTagReport(uint8_t _gameID, uint8_t _teamNumber, uint8_t _playerNumber, uint8_t _reportRequired)
{
    if(DEBUG)   Serial.println("ESP32_IR::requestTagReport()");
    
    clearIRdataArray();
    
    encodeLTTO(PACKET,  49);            //0x31
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _teamNumber);
    encodeLTTO(DATA,    _playerNumber);
    encodeLTTO(DATA,    _reportRequired);
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
}

////////////////////////////
////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::taggerRequestToJoin(uint8_t _gameID, uint8_t _taggerID, uint8_t _preferredTeam, bool _isLtar)
//NB in LTAR mode _preferredTeam is actually TaggerInformation (optional)
{
    if(DEBUG)   Serial.println("ESP32_IR::taggerRequestToJoin()");
    if(_isLtar) _preferredTeam = 0x1B;  //Fake up Firmware Version.
    
    clearIRdataArray();
    
    if(_isLtar) encodeLTTO(PACKET, 130);
    else        encodeLTTO(PACKET,  16);
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _taggerID);
    encodeLTTO(DATA,    _preferredTeam);
    encodeLTTO(CHECKSUM);
    
