rmick/esp32_IR_Ltto/ESP32_IR_LTTO.cpp
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::taggerAckPlayerAssign(uint8_t _gameID, uint8_t _taggerID)
{
    if(DEBUG)   Serial.println("ESP32_IR::taggerAckPlayerAssign()");
    
    clearIRdataArray();
    
    encodeLTTO(PACKET,  17);
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _taggerID);
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::taggerTagSummary(uint8_t _gameID,          uint8_t _teamAndPlayerNumber,
                                uint8_t _totalNumberTagsRx,
                                uint8_t _survivalMinutes, uint8_t _survivalSeconds,
                                uint8_t _zoneTimeMinutes, uint8_t _zoneTimeSeconds,
                                uint8_t _teamReportFlag)
{
    if(DEBUG)   Serial.println("ESP32_IR::taggerTagSummary()");
        
    clearIRdataArray();
    
    encodeLTTO(PACKET,  64);            //0x40
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _teamAndPlayerNumber);
    encodeLTTO(DATA,    convertDecToBCD(_totalNumberTagsRx));
    encodeLTTO(DATA,    convertDecToBCD(_survivalMinutes));
    encodeLTTO(DATA,    convertDecToBCD(_survivalSeconds));
    encodeLTTO(DATA,    convertDecToBCD(_zoneTimeMinutes));
    encodeLTTO(DATA,    convertDecToBCD(_zoneTimeSeconds));
    encodeLTTO(DATA,    _teamReportFlag);
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////

void ESP32_IR::taggerTeamReport(uint8_t _teamToReport,     uint8_t _gameID,                uint8_t _teamAndPlayerNumber,
                                uint8_t _playersIncluded,  uint8_t _player1tags,           uint8_t _player2tags,
                                uint8_t _player3tags,      uint8_t _player4tags,           uint8_t _player5tags,
                                uint8_t _player6tags,      uint8_t _player7tags,           uint8_t _player8tags)
{
    if(DEBUG)   Serial.println("ESP32_IR::taggerTagSummary()");
    
    clearIRdataArray();
    
    switch(_teamToReport)
    {
        case 1:
            encodeLTTO(PACKET, 65 );      //0x41
            break;
        case 2:
            encodeLTTO(PACKET,  66);      //0x42
            break;
        case 3:
            encodeLTTO(PACKET,  67);      //0x43
            break;
    }
    encodeLTTO(DATA,    _gameID);
    encodeLTTO(DATA,    _teamAndPlayerNumber);
    encodeLTTO(DATA,    (_playersIncluded));
    if(_playersIncluded && 0xb00000001) encodeLTTO(DATA,    (_player1tags));
    if(_playersIncluded && 0xb00000010) encodeLTTO(DATA,    (_player2tags));
    if(_playersIncluded && 0xb00000100) encodeLTTO(DATA,    (_player3tags));
    if(_playersIncluded && 0xb00001000) encodeLTTO(DATA,    (_player4tags));
    if(_playersIncluded && 0xb00010000) encodeLTTO(DATA,    (_player5tags));
    if(_playersIncluded && 0xb00100000) encodeLTTO(DATA,    (_player6tags));
    if(_playersIncluded && 0xb01000000) encodeLTTO(DATA,    (_player7tags));
    if(_playersIncluded && 0xb10000000) encodeLTTO(DATA,    (_player8tags));
    encodeLTTO(CHECKSUM);
    
    sendIR(irDataArray, sizeof(irDataArray) );
}

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

                 
int ESP32_IR::encodeTeamAndPlayer(uint8_t _teamNumber, uint8_t _playerNumber)
{
    uint8_t _teamAndPlayer = 0;
    
    if(_teamNumber == 0)    //zero-based player number + 8
    {
        if(DEBUG)   Serial.println("ESP32_IR::encodeTeamAndPlayer() - Team = 0");
        _teamAndPlayer = _playerNumber + 7;
    }
    else
    {
        if(DEBUG)   Serial.print("ESP32_IR::encodeTeamAndPlayer() - Team = ");
        if(DEBUG)   Serial.println(_teamNumber);
        _teamAndPlayer = _teamNumber << 3;
        _teamAndPlayer += (_playerNumber -1);
    }
    if(DEBUG)   Serial.print("ESP32_IR::encodeTeamAndPlayer() = ");
    if(DEBUG)   Serial.println(_teamAndPlayer);
    return _teamAndPlayer;
}

//int ESP32_IR::decodeTeamAndPlayer(uint8_t _teamAndPlayerNumber)
//{
//    Serial.println("\n\n\n\t\tESP32_IR::decodeTeamAndPlayer() has no code yet !!!!\n\n\n");"
//    //TODO:
//}



//////////////////////////////////////////////////////////////////////////////////////////

int ESP32_IR::convertDecToBCD(int _dec)
{
    if (_dec == 100) return 0xFF;
    return (int) (((_dec/10) << 4) | (_dec %10) );
}

//////////////////////////////////////////////////////////////////////////////////////////

int ESP32_IR::convertBCDtoDec(int _bcd)
{
    if (_bcd == 0xFF) return _bcd;
    return (int) (((_bcd >> 4) & 0xF) *10) + (_bcd & 0xF);
}

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
